"""
Task 6:
Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""

a = input('Введите букву латинского алфавита: ')
print(f'Вы ввели {ord(a)-96} букву алфавита')